# Pandas Exercises (Solution)

## Overview

This module covers essential Pandas operations, including data manipulation, analysis, and basic statistical functions. It provides hands-on experience with real-world data using the Pandas library.

## Learning Objectives

- Convert list of dictionaries and CSV files to DataFrames
- Perform data access operations using Pandas
- Handle missing data with `fillna` function
- Apply descriptive statistics functions to analyze data
- Utilize Pandas for data slicing and dicing

## Prerequisites

- Basic understanding of Python
- Familiarity with Jupyter notebooks
- Installed libraries: numpy, pandas

## Get Started

### Import necessary libraries

In [1]:
# Importing the numpy library, which provides support for large, multi-dimensional arrays and matrices
# It also provides mathematical functions to operate on these arrays
import numpy as np

# Importing the pandas library, which is a powerful, flexible, and easy-to-use data manipulation and analysis tool
# It provides data structures such as DataFrame and Series to handle and analyze structured data
import pandas as pd

## Convert list of dictionaries to DataFrame

In [2]:
# List of dictionaries containing city names and associated data values
d = [
    # First city: Delhi with associated data value 1000
    {"city": "Delhi", "data": 1000},
    
    # Second city: Bangalore with associated data value 2000
    {"city": "Bangalore", "data": 2000},
    
    # Third city: Mumbai with associated data value 1000
    {"city": "Mumbai", "data": 1000},
]

# Output the list of dictionaries
d

[{'city': 'Delhi', 'data': 1000},
 {'city': 'Bangalore', 'data': 2000},
 {'city': 'Mumbai', 'data': 1000}]

Convert the list of dictionaries `d` into a DataFrame.

In [3]:
# Create a pandas DataFrame from the dictionary 'd'
df = pd.DataFrame(d)

# Display the DataFrame
df

        city  data
0      Delhi  1000
1  Bangalore  2000
2     Mumbai  1000

## Convert CSV files to DataFrame

Read in csv file and convert it to DataFrame.

In [4]:
# Read the CSV file containing city data into a pandas DataFrame
# The path to the CSV file is provided as relative from the current working directory
city_data = pd.read_csv("../../Data/simplemaps-worldcities-basic.csv")

Show the first 10 rows of converted DataFrame.

In [5]:
# Display the first 10 rows of the 'city_data' DataFrame
city_data.head(n=10)

,city,city_ascii,lat,lng,pop,country,iso2,iso3,province
0,Qal eh-ye Now,Qal eh-ye,34.983000,63.133300,2997.0,Afghanistan,AF,AFG,Badghis
1,Chaghcharan,Chaghcharan,34.516701,65.250001,15000.0,Afghanistan,AF,AFG,Ghor
2,Lashkar Gah,Lashkar Gah,31.582998,64.360000,201546.0,Afghanistan,AF,AFG,Hilmand
3,Zaranj,Zaranj,31.112001,61.886998,49851.0,Afghanistan,AF,AFG,Nimroz
4,Tarin Kowt,Tarin Kowt,32.633298,65.866699,10000.0,Afghanistan,AF,AFG,Uruzgan
5,Zareh Sharan,Zareh Sharan,32.850000,68.416705,13737.0,Afghanistan,AF,AFG,Paktika
6,Asadabad,Asadabad,34.866000,71.150005,48400.0,Afghanistan,AF,AFG,Kunar
7,Taloqan,Taloqan,36.729999,69.540004,64256.0,Afghanistan,AF,AFG,Takhar
8,Mahmud-E Eraqi,Mahmud-E Eraqi,35.016696,69.333301,7407.0,Afghanistan,AF,AFG,Kapisa
9,Mehtar Lam,Mehtar Lam,34.650000,70.166701,17345.0,Afghanistan,AF,AFG,Laghman

## Data Access

### Head and Tail

Get the last 10 rows of `city_data`:

In [6]:
# The .tail(10) method retrieves the last 10 rows of the DataFrame
# This is useful for quickly inspecting the end of the dataset
city_data.tail(10)

,city,city_ascii,lat,lng,pop,country,iso2,iso3,province
7312,Karoi,Karoi,-16.819556,29.679987,13194.0,Zimbabwe,ZW,ZWE,Mashonaland West
7313,Chinhoyi,Chinhoyi,-17.359626,30.180008,52812.0,Zimbabwe,ZW,ZWE,Mashonaland West
7314,Kariba,Kariba,-16.529600,28.800040,23133.5,Zimbabwe,ZW,ZWE,Mashonaland West
7315,Hwange,Hwange,-18.370004,26.500026,33599.5,Zimbabwe,ZW,ZWE,Matabeleland North
7316,Gweru,Gweru,-19.450041,29.820030,164715.5,Zimbabwe,ZW,ZWE,Midlands
7317,Mutare,Mutare,-18.970019,32.650038,216785.0,Zimbabwe,ZW,ZWE,Manicaland
7318,Kadoma,Kadoma,-18.330006,29.909947,56400.0,Zimbabwe,ZW,ZWE,Mashonaland West
7319,Chitungwiza,Chitungwiza,-18.000001,31.100003,331071.0,Zimbabwe,ZW,ZWE,Harare
7320,Harare,Harare,-17.817790,31.044709,1557406.5,Zimbabwe,ZW,ZWE,Harare
7321,Bulawayo,Bulawayo,-20.169998,28.580002,697096.0,Zimbabwe,ZW,ZWE,Bulawayo

### Slicing and Dicing

In [7]:
# Extract the 'lat' column from the DataFrame as a Pandas Series
# This creates a one-dimensional labeled array with the latitude values
series_es = city_data.lat

# Use the type() function to determine the data type of 'series_es'
# This will return <class 'pandas.core.series.Series'>, confirming it's a Pandas Series
type(series_es)

pandas.core.series.Series

Get the first 5 odd number of rows of `series_es`:

In [8]:
# Slice the `series_es` object to extract elements from index 1 to 10 (exclusive) with a step of 2
# This means selecting every second element starting from index 1 up to (but not including) index 10
series_es[1:10:2]

1    34.516701
3    31.112001
5    32.850000
7    36.729999
9    34.650000
Name: lat, dtype: float64

Get the first 8 rows of `series_es`:

In [9]:
# Slice the `series_es` object to extract elements from the beginning up to index 8 (exclusive)
# This selects all elements from index 0 to index 7
series_es[:8]

0    34.983000
1    34.516701
2    31.582998
3    31.112001
4    32.633298
5    32.850000
6    34.866000
7    36.729999
Name: lat, dtype: float64

Get first 8 rows of `city_data`:

In [10]:
# Slice the `city_data` array to extract the first 8 rows
# This selects all rows from index 0 to index 7 (inclusive)
city_data[:8]

,city,city_ascii,lat,lng,pop,country,iso2,iso3,province
0,Qal eh-ye Now,Qal eh-ye,34.983000,63.133300,2997.0,Afghanistan,AF,AFG,Badghis
1,Chaghcharan,Chaghcharan,34.516701,65.250001,15000.0,Afghanistan,AF,AFG,Ghor
2,Lashkar Gah,Lashkar Gah,31.582998,64.360000,201546.0,Afghanistan,AF,AFG,Hilmand
3,Zaranj,Zaranj,31.112001,61.886998,49851.0,Afghanistan,AF,AFG,Nimroz
4,Tarin Kowt,Tarin Kowt,32.633298,65.866699,10000.0,Afghanistan,AF,AFG,Uruzgan
5,Zareh Sharan,Zareh Sharan,32.850000,68.416705,13737.0,Afghanistan,AF,AFG,Paktika
6,Asadabad,Asadabad,34.866000,71.150005,48400.0,Afghanistan,AF,AFG,Kunar
7,Taloqan,Taloqan,36.729999,69.540004,64256.0,Afghanistan,AF,AFG,Takhar

Get the first 4 columns of the first 5 rows of **city_data**:

In [11]:
# Use `.iloc` to slice the `city_data` DataFrame
# `.iloc` is used for integer-location based indexing
# `:5` selects the first 5 rows (indices 0 to 4)
# `:4` selects the first 4 columns (indices 0 to 3)
city_data.iloc[:5, :4]

            city   city_ascii        lat        lng
0  Qal eh-ye Now    Qal eh-ye  34.983000  63.133300
1    Chaghcharan  Chaghcharan  34.516701  65.250001
2    Lashkar Gah  Lashkar Gah  31.582998  64.360000
3         Zaranj       Zaranj  31.112001  61.886998
4     Tarin Kowt   Tarin Kowt  32.633298  65.866699

Select cities that have population of more than 10 million and select columns with column name start with the letter `p`:

In [12]:
# Filter the city_data dataframe to include cities with a population greater than 10 million
# The condition city_data["pop"] > 10000000 selects rows where the population exceeds 10 million
# Then, select only the columns whose names start with "p"
# This is achieved using the str.startswith("p") function on the column names
city_data[city_data["pop"] > 10000000][
    city_data.columns[pd.Series(city_data.columns).str.startswith("p")]
]

             pop                province
360   11862073.0  Ciudad de Buenos Aires
1171  14433147.5               São Paulo
2068  14797756.0                Shanghai
3098  11779606.5                   Delhi
3110  15834918.0             Maharashtra
3492  22006299.5                   Tokyo
4074  14919501.0        Distrito Federal
4513  11877109.5                    Sind
5394  10452000.0                  Moskva
6124  10003305.0                Istanbul
7071  13524139.0                New York

## Data Operations

### Missing data and the `fillna` function

In [14]:
# Create a DataFrame with 8 rows and 3 columns, filled with random numbers from a normal distribution
df = pd.DataFrame(np.random.randn(8, 3), columns=["A", "B", "C"])

# Set a specific value (at row 4, column 'C') to NaN (missing value)
df.iloc[4, 2] = np.nan

# Display the DataFrame
df

          A         B         C
0 -0.022991  0.107699 -1.314345
1 -0.308230 -0.042155 -0.326718
2  0.030758 -0.409561  0.759102
3 -0.917075  0.652545 -0.303112
4 -0.810755 -1.723134       NaN
5 -0.143315  0.898778  2.257264
6  0.370698  1.641371  0.183067
7 -0.989167 -1.343341  1.371197

Replace all the "NaN" in `df` with `0`:

In [15]:
# Replace all missing values (NaN) in the DataFrame `df` with 0
# `fillna(0)` fills NaN values with the specified value (in this case, 0)
df_filled = df.fillna(0)

# Display the DataFrame with missing values replaced
df_filled

          A         B         C
0 -0.022991  0.107699 -1.314345
1 -0.308230 -0.042155 -0.326718
2  0.030758 -0.409561  0.759102
3 -0.917075  0.652545 -0.303112
4 -0.810755 -1.723134  0.000000
5 -0.143315  0.898778  2.257264
6  0.370698  1.641371  0.183067
7 -0.989167 -1.343341  1.371197

## Descriptive Statistics functions

In [16]:
# Define a list of column names that contain numeric data
# This list can be used to select or manipulate specific columns in a DataFrame
columns_numeric = ["lat", "lng", "pop"]

Get average `lat`, `lng`, and `pop` values:

In [17]:
# Calculate the mean (average) of the numeric columns in `city_data` specified by `columns_numeric`
# `columns_numeric` is a list of column names containing numeric data (e.g., ["lat", "lng", "pop"])
# The `.mean()` function computes the mean for each column
mean_values = city_data[columns_numeric].mean()

# Display the mean values for the specified columns
mean_values

lat        20.662876
lng        10.711914
pop    265463.071633
dtype: float64

Get sum of `lat`, `lng`, and `pop` values:

In [18]:
# Calculate the sum of the numeric columns in `city_data` specified by `columns_numeric`
# `columns_numeric` is a list of column names containing numeric data (e.g., ["lat", "lng", "pop"])
# The `.sum()` function computes the sum for each column
sum_values = city_data[columns_numeric].sum()

# Display the sum values for the specified columns
sum_values

lat    1.512936e+05
lng    7.843263e+04
pop    1.943721e+09
dtype: float64

Get total number of `lat`, `lng`, and `pop` values:

In [19]:
# Count the number of non-missing (non-NaN) values in the numeric columns of `city_data` specified by `columns_numeric`
# `columns_numeric` is a list of column names containing numeric data (e.g., ["lat", "lng", "pop"])
# The `.count()` function counts the number of non-missing values for each column
count_values = city_data[columns_numeric].count()

# Display the count of non-missing values for the specified columns
count_values

lat    7322
lng    7322
pop    7322
dtype: int64

Get 75 percentile of `lat`, `lng`, and `pop` values:

In [20]:
# Calculate the 75th percentile (third quartile) for the numeric columns in `city_data` specified by `columns_numeric`
# `columns_numeric` is a list of column names containing numeric data (e.g., ["lat", "lng", "pop"])
# The `.quantile(0.75)` function computes the 75th percentile for each column
quantile_values = city_data[columns_numeric].quantile(0.75)

# Display the 75th percentile values for the specified columns
quantile_values

lat        43.575448
lng        73.103628
pop    200172.625000
Name: 0.75, dtype: float64

Get sums of each row:

In [21]:
# Calculate the sum of numeric columns in `city_data` specified by `columns_numeric` row-wise (across columns)
# `columns_numeric` is a list of column names containing numeric data (e.g., ["lat", "lng", "pop"])
# The `.sum(axis=1)` function computes the sum for each row (axis=1 refers to columns)
row_sums = city_data[columns_numeric].sum(axis=1)

# Display the sum of numeric values for each row
row_sums

0       3.095116e+03
1       1.509977e+04
2       2.016419e+05
3       4.994400e+04
4       1.009850e+04
            ...
7317    2.167987e+05
7318    5.641158e+04
7319    3.310841e+05
7320    1.557420e+06
7321    6.971044e+05
Length: 7322, dtype: float64

Calculate
the most important statistics for numerical data in one go so that we don’t have to use individual functions:

In [22]:
# Generate descriptive statistics for the numeric columns in `city_data` specified by `columns_numeric`
# `columns_numeric` is a list of column names containing numeric data (e.g., ["lat", "lng", "pop"])
# The `.describe()` function computes summary statistics for each column
summary_statistics = city_data[columns_numeric].describe()

# Display the summary statistics for the specified columns
summary_statistics

               lat          lng           pop
count  7322.000000  7322.000000  7.322000e+03
mean     20.662876    10.711914  2.654631e+05
std      29.134818    79.044615  8.287622e+05
min     -89.982894  -179.589979 -9.900000e+01
25%      -0.324710   -64.788472  1.734425e+04
50%      26.792730    18.617509  6.132275e+04
75%      43.575448    73.103628  2.001726e+05
max      82.483323   179.383304  2.200630e+07

## Conclusion

In this module, you've learned how to:

- Convert different data formats to Pandas DataFrames
- Access and manipulate data using Pandas
- Handle missing data
- Perform basic statistical analysis on datasets
- Use various Pandas functions for data exploration and manipulation

These skills form a foundation for more advanced data analysis and machine learning tasks using Python and Pandas.

## Clean up

Remember to shut down your Jupyter notebook kernel when you're done to free up resources.